fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции


// ВКМ_ Начало: печать акта об оказанных услугах

// Включает объект в механизм команд печати БСП.
//
// Параметры:
//  НастройкиОбъекта - см. УправлениеПечатью.НастройкиПечатиОбъекта
//
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина;
	
КонецПроцедуры

// Добавляет команду печати акта об оказанных услугах.
//
// Параметры:
//  КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВКМ_АктОбОказанныхУслугах";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказанных услугах'");
	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

// Формирует печатные формы документа.
//
// Параметры:
//  МассивОбъектов        - Массив из ДокументСсылка.РеализацияТоваровУслуг - документы,
//                          для которых формируется печать.
//  ПараметрыПечати       - Структура  - дополнительные параметры печати.
//  КоллекцияПечатныхФорм - см. УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм
//  ОбъектыПечати         - СписокЗначений из ДокументСсылка.РеализацияТоваровУслуг - соответствие
//                          объектов областям табличного документа.
//  ПараметрыВывода       - Структура  - параметры вывода печатных форм.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ВКМ_АктОбОказанныхУслугах");
	Если ПечатнаяФорма <> Неопределено Тогда
		ПечатнаяФорма.ТабличныйДокумент = ВКМ_ПечатьАкта(МассивОбъектов, ОбъектыПечати);
		ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказанных услугах'");
		ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ПФ_MXL_ВКМ_АктОбОказанныхУслугах";
	КонецЕсли;
	
КонецПроцедуры

// ВКМ_ Конец: печать акта об оказанных услугах

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ВКМ_ Начало: формирование акта об оказанных услугах

// Формирует табличный документ с актами об оказанных услугах.
//
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка.РеализацияТоваровУслуг - документы реализации.
//  ОбъектыПечати  - СписокЗначений из ДокументСсылка.РеализацияТоваровУслуг - соответствие
//                   объектов областям табличного документа.
//
// Возвращаемое значение:
//  ТабличныйДокумент - сформированные акты, по одному на страницу.
//
Функция ВКМ_ПечатьАкта(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ВКМ_АктОбОказанныхУслугах";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы(
		"Документ.РеализацияТоваровУслуг.ПФ_MXL_ВКМ_АктОбОказанныхУслугах");
	
	ДанныеДокументов = ВКМ_ДанныеДляАкта(МассивОбъектов);
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВКМ_ВывестиШапкуАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
		ВКМ_ВывестиУслугиАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
		ВКМ_ВывестиПодвалАкта(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент,
			НомерСтрокиНачало, ОбъектыПечати, ДанныеДокументов.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Получает данные документов для печати акта.
//
// Параметры:
//  МассивОбъектов - Массив из ДокументСсылка.РеализацияТоваровУслуг - документы реализации.
//
// Возвращаемое значение:
//  ВыборкаИзРезультатаЗапроса - данные документов вместе с табличной частью услуг.
//
Функция ВКМ_ДанныеДляАкта(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Реализация.Ссылка КАК Ссылка,
		|	Реализация.Номер КАК Номер,
		|	Реализация.Дата КАК Дата,
		|	Реализация.Организация КАК Организация,
		|	Реализация.Контрагент КАК Контрагент,
		|	Реализация.Договор КАК Договор,
		|	Реализация.СуммаДокумента КАК СуммаДокумента,
		|	Реализация.Ответственный КАК Ответственный,
		|	Реализация.Товары.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма
		|	) КАК Товары,
		|	Реализация.Услуги.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма
		|	) КАК Услуги
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК Реализация
		|ГДЕ
		|	Реализация.Ссылка В (&МассивОбъектов)";
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

// Выводит шапку акта: номер, дату и реквизиты сторон.
//
Процедура ВКМ_ВывестиШапкуАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	Область = Макет.ПолучитьОбласть("Шапка");
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("НомерДокумента",
		ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер));
	ДанныеПечати.Вставить("ДатаДокумента", Формат(ДанныеДокументов.Дата, "ДЛФ=DD"));
	ДанныеПечати.Вставить("Организация", ДанныеДокументов.Организация);
	ДанныеПечати.Вставить("Контрагент", ДанныеДокументов.Контрагент);
	ДанныеПечати.Вставить("Договор", ДанныеДокументов.Договор);
	
	Область.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(Область);
	
КонецПроцедуры

// Выводит табличную часть акта и итоговую сумму.
// Выводятся обе табличные части документа: акт по абонентскому договору
// содержит и услуги, и проданные клиенту расходные материалы, иначе строки
// акта не сошлись бы с его итоговой суммой.
//
Процедура ВКМ_ВывестиУслугиАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	НомерСтрокиАкта = 0;
	
	ТабличныеЧасти = Новый Массив;
	ТабличныеЧасти.Добавить(ДанныеДокументов.Услуги);
	ТабличныеЧасти.Добавить(ДанныеДокументов.Товары);
	
	Для Каждого ТабличнаяЧасть Из ТабличныеЧасти Цикл
		
		Выборка = ТабличнаяЧасть.Выбрать();
		Пока Выборка.Следующий() Цикл
			НомерСтрокиАкта = НомерСтрокиАкта + 1;
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ОбластьСтрока.Параметры.НомерСтроки = НомерСтрокиАкта;
			ТабличныйДокумент.Вывести(ОбластьСтрока);
		КонецЦикла;
		
	КонецЦикла;
	
	ОбластьИтого = Макет.ПолучитьОбласть("Итого");
	ОбластьИтого.Параметры.Итого = ДанныеДокументов.СуммаДокумента;
	ТабличныйДокумент.Вывести(ОбластьИтого);
	
КонецПроцедуры

// Выводит подвал акта: сумму прописью и поля для подписей.
//
Процедура ВКМ_ВывестиПодвалАкта(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	Область = Макет.ПолучитьОбласть("Подвал");
	
	ДанныеПечати = Новый Структура;
	ДанныеПечати.Вставить("СуммаПрописью", ВКМ_СуммаПрописью(ДанныеДокументов.СуммаДокумента));
	ДанныеПечати.Вставить("Ответственный", ДанныеДокументов.Ответственный);
	
	Область.Параметры.Заполнить(ДанныеПечати);
	ТабличныйДокумент.Вывести(Область);
	
КонецПроцедуры

// Возвращает сумму прописью в рублях и копейках.
//
// Параметры:
//  Сумма - Число - сумма документа.
//
// Возвращаемое значение:
//  Строка - сумма прописью.
//
Функция ВКМ_СуммаПрописью(Сумма)
	
	ПараметрыПредмета = НСтр("ru = 'рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2'");
	Возврат ЧислоПрописью(Сумма, "Л=ru_RU", ПараметрыПредмета);
	
КонецФункции

// ВКМ_ Конец: формирование акта об оказанных услугах

#КонецОбласти

#КонецЕсли
